package com.seebon.rpa.context.enums;

import com.seebon.rpa.context.annotation.DataDictKey;

@DataDictKey(value = "1967", name = "附件类型")
public enum AttFileKey {
    key1("10014001", "身份证复印件"),
    key2("10014002", "个人照片"),
    key3("10014003", "解除合同通知书"),
    key4("10014004", "离职证明"),
    key5("10014005", "社保登记备案花名册"),
    key6("10014006", "劳动合同复印件"),
    key7("10014007", "单位情况说明书"),
    key8("10014008", "补缴申请证明"),
    key9("10014009", "情况说明"),
    key10("10014010", "撤销增员情况说明"),
    key11("10014011", "撤销减员情况说明"),
    key12("10014012", "汇缴调整情况说明"),
    key13("10014013", "参保证明"),
    key14("10014014", "劳动合同"),
    key15("10014015", "增员情况说明"),
    key16("10014016", "职工代表大会(或工会)会议决议书"),
    key17("10014017", "承诺书"),
    key18("10014018", "银行流水"),
    key19("10014019", "社保增员花名册"),
    key20("10014020", "社保减员花名册"),
    key21("10014021", "身份证扫描件"),
    key22("10014022", "启封申请表"),
    key23("10014023", "转移委托书"),
    key24("10014024", "增员名册"),
    key25("10014025", "减员名册"),
    key26("10014026", "解除劳动关系证明"),
    key27("10014027", "劳动合同工时标准页"),
    key28("10014028", "劳动合同工资标准页"),
    key29("10014029", "劳动合同签字盖章页"),
    key30("10014030", "劳动合同甲乙方基本信息页"),
    key31("10014031", "开户申请表"),
    key32("10014032", "转移申请表"),
    key33("10014033", "实习协议"),
    key34("10014034", "医疗减员花名册"),
    key35("10014035", "解除证明书"),
    key36("10014036", "居民身份证(反面)"),
    key37("10014037", "居民身份证正面"),
    key38("10014038", "盖章增员表"),
    key39("10014039", "职工基本医疗保险参保登记表"),
    key40("10014040", "城镇职工基本医疗保险参保登记表"),
    ;
    String key;
    String name;

    public String getName() {
        return name;
    }

    public String getKey() {
        return key;
    }

    AttFileKey(String key, String name) {
        this.key = key;
        this.name = name;
    }
}
